// let a;
// console.log(a);
// console.log(typeof a) 

// типизация: 
//промежуток времени за который происходит компиляция - compile time.
// после компиляции идет стадия исполнения - runtime
// 1) статическая и динамическая; (когда проверять типы?)
// - некоторые языки проверяют типы и ищут ошибки на стадии компиляции (статическая типизация). c#, c++, java.
// - другие проверяют типы и ищут ошибки на стадии выполнения (динамическая типизация). js, php, ruby.
// 2) слабая и сильная.(насколько серьезно проверять типы?)
// 4 + "7" // "47"
// 4 * "7" // 28

// Number('47') // 47
// Bolean(1) // true
// Bolean(0) // false
// String(haha) // 'haha'
// String(23) // '23'

// null - это значит что значения нет

// let a = null;
// console.log(a) // null

// == сравнивает значение
// === сравнивает тип и значение (полностью сравнивает элемент два элемента)